---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarShapeFailure
source: html/24c90200-17ef-d09c-bc5c-c01cb1f14da3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarShapeFailure Property

Can't solve Rebar Shape.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarShapeFailure { get; }
```